export default function HotelFeatures() {
  return (
    <section className="bg-gray-50 p-4 rounded-lg shadow-sm mb-4 text-right">
      <h2 className="text-xl font-semibold mb-2 text-blue-800">مميزات الفندق:</h2>
      <ul className=" pr-6 text-gray-700 list-disc">
        <li>يطل فندق فالكون هيلز على جبال سيناء ويوفر أماكن إقامة بسعر معقول وقيمة عالية مع شاطئين قريبين، ويتميز بمسبحين خارجيين وملاعب تنس وسبا مع علاجات المساج.</li>
        <li>يقع الفندق على هضبة رأس أم سيد ويوفر معدات الغوص لاستكشاف الشعاب المرجانية في البحر الأحمر، ويبعد شاطئ أمفورا 750 مترًا فقط، بينما يمكن الوصول إلى شاطئ فالكون هيلز الخاص من خلال خدمة نقل ذهاباً وإياباً مجاناً.</li>
        <li>تفتح جميع الغرف على شرفة خاصة وتحتوي على تلفزيون مع قنوات فضائية وحمامات داخلية مع حوض استحمام ودُش، ويتوفر تكييف الهواء بشكل قياسي.</li>
        <li>مكن للضيوف تناول المشروبات المنعشة على مدار الساعة والاستفادة من بار المسبح، كما تتوفر خدمة نقل ذهاباً وإياباً مجاناً إلى خليج نعمة الشهير، ويبعد مطار شرم الشيخ 17 كم وتتوفر مواقف مجانية خاصة للسيارات في الفندق.</li>
      </ul>
    </section>
  );
}
